
"%d years ago" = "%d年前";

"%d years later" = "%d年後";

"1 year ago" = "1年前";

"1 year later" = "1年後";

"%d months ago" = "%d月前";

"%d months later" = "%d月後";

"1 month ago" = "1月前";

"1 month later" = "1月後";

"%d weeks ago" = "%d週間前";

"%d weeks later" = "%d週間後";

"1 week ago" = "1週間前";

"1 week later" = "1週間後";

"%d days ago" = "%d日前";

"%d days later" = "%d日後";

"1 day ago" = "1日前";

"1 day later" = "1日後";

"%d hours ago" = "%d時間前";

"%d hours later" = "%d時間後";

"1 hour ago" = "1時間前";

"1 hour later" = "1時間後";

"%d minutes ago" = "%d分前";

"%d minutes later" = "%d分前後";

"1 minute ago" = "1分前";

"1 minute later" = "1分後";

"%d seconds ago" = "%d秒前";

"%d seconds later" = "%d秒後";

"1 second ago" = "1秒前";

"1 second later" = "1秒後";

"just now" = "現在";